/******************************************************************************

                  版权所有 (C), 2001-2011, 

 ******************************************************************************
  文 件 名   : adf4351.h
  版 本 号   : 初稿
  作    者   : zhonghai
  生成日期   : 2016年8月7日
  最近修改   :
  功能描述   : adf4351.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年8月7日
    作    者   : zhonghai
    修改内容   : 创建文件

******************************************************************************/
#ifndef __ADF4351_H__
#define __ADF4351_H__
/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "includes.h"
/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/


typedef struct{
	uint32_t num;/*1-主，2-附*/

	uint32_t reg0;
	uint32_t reg1;
	uint32_t reg2;
	uint32_t reg3;
	uint32_t reg4;
	uint32_t reg5;
	
	uint32_t integer;
	uint32_t fraction;
	uint32_t frac_value;
	uint32_t mod_value;
	uint32_t div;
	uint32_t rf_freq_hz;
	uint32_t cp_value;
	
}pll_info_t;

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

extern void adf4351_init(uint32_t num,pll_info_t *pll);
extern void WriteToADF4350(unsigned char count, unsigned char *buf);
extern void rf_out(pll_info_t *pll);
extern void printf_pll_info(pll_info_t *pll);
extern void cfg_adf4351(pll_info_t *pll);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __ADF4351_H__ */
